Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The value to be added must be the same type as that held within the grid cell, ie: you cannot add a string to a real or vice-versa, and for strings this corresponds to concatenation.
zh_cn: 要添加的值必须与网格单元格中保存的值的类型相同，即:您不能将字符串添加到实数中，反之亦然，对于字符串，这对应于连接。

source: The value to be converted
zh_cn: 要转换的值

source: The value to be sent as an increment.
zh_cn: 作为增量发送的值。

source: The value to be turned into a string or a format string.
zh_cn: 要转换为字符串或格式字符串的值。

source: The value to change the priority of.
zh_cn: 要更改的优先级的值。

source: The value to check inside the array.
zh_cn: 要在数组内部检查的值。

source: The value to check.
zh_cn: 要检查的值。

source: The value to clamp.
zh_cn: 要夹紧的值。

source: The value to convert.
zh_cn: 要转换的值。

source: The value to delete from the priority queue.
zh_cn: 要从优先队列中删除的值。

source: The value to find the priority of.
zh_cn: 要查找的优先级的值。

source: The value to find.
zh_cn: 要查找的值。

source: The value to insert
zh_cn: 要插入的值

source: The value to multiply the cells within the disk with.
zh_cn: 要与圆盘内的单元格相乘的值。

source: The value to multiply with the cell.
zh_cn: 要与单元格相乘的值。

source: The value to multiply with the region cells.
zh_cn: 要与区域单元格相乘的值。

source: The value to push onto the end of the array
zh_cn: 要推入数组末尾的值

source: The value to push onto the stack.
zh_cn: 要推入堆栈的值。

source: The value to return if a value is not found in the defined place (or the .ini file does not exist).
zh_cn: 如果在定义的位置找不到值（或 .ini 文件不存在），则返回的值。

source: The value to return the inverse cosine of.
zh_cn: 要返回其反余弦值的值。

source: The value to return the inverse sine of.
zh_cn: 要返回其反正弦的值。

source: The value to return the inverse tangent of.
zh_cn: 要返回其反正切值的值。

source: The value to search for.
zh_cn: 要搜索的值。

source: The value to set (can be string or real, depending on the option).
zh_cn: 要设置的值(可以是字符串或实数，取决于选项)。

source: The value to set in the list.
zh_cn: 要在列表中设置的值。

source: The value to set the global variable to
zh_cn: 全局变量要设置的值

source: The value to set the key to.
zh_cn: 要设置键的值。

source: The value to set the option to (can be boolean, real, integer or string - see the table above)
zh_cn: 将选项设置为的值(可以是boolean, real, integer 或 string -参见上表)

source: The value to set the region cells to.
zh_cn: 区域单元格要设置的值。

source: The value to set the variable to
zh_cn: 要将变量设置为的值

source: The value to set with the cells within the disk.
zh_cn: 要用圆盘内的单元格设置的值。

source: The value to set.
zh_cn: 要设置的值。

source: The value to use to initialise all array indices (optional).
zh_cn: 用于初始化所有数组索引的值(可选)。

source: The value with which to set the cell.
zh_cn: 用来设置单元格的值。

source: The values available for use are any of the following constants (the default value is cmpfunc_lessequal):
zh_cn: 可用的值是以下常量中的任意一个(默认值是cmpfunc_lessequal):

source: The values be concatenated.
zh_cn: 这些值被连接起来。

source: The values be joined using the delimiter.
zh_cn: 值可以使用分隔符连接。

source: The values that can be assigned are based on positive or negative numbers, with 0 being the default value (meaning that the instance with this fixture setting is ignored unless a collision event is created for it).
zh_cn: 可分配的值基于正数或负数，其中0是默认值(意味着具有此夹具设置的实例将被忽略，除非为其创建碰撞事件)。

source: The values to compare.
zh_cn: 要比较的值。

source: The variable index to check for the data structure
zh_cn: 用于检查数据结构的变量索引

source: The variable that holds the array.
zh_cn: 保存数组的变量。

source: The variable that holds the first array.
zh_cn: 保存第一个数组的变量。

source: The variable that holds the nth array.
zh_cn: 保存第n个数组的变量。

source: The variable that holds the second array.
zh_cn: 保存第二个数组的变量。

source: The variable to check.
zh_cn: 要检查的变量。

source: The variable to get the data type of.
zh_cn: 的数据类型的变量。

source: The variable which defines total health (between 0 and 100)
zh_cn: 定义总体健康状况的变量(介于0和100之间)

source: The various parameters for the icon (see description).
zh_cn: 图标的各种参数(参见说明)。

source: The vertex buffer index to use.
zh_cn: 要使用的顶点缓冲区索引。

source: The vertex buffer to check.
zh_cn: 要检查的顶点缓冲区。

source: The vertex format to use.
zh_cn: 要使用的顶点格式。

source: The vertex must have been formatted correctly to accept this using the vertex_format_add_custom() function.
zh_cn: 必须使用vertex_format_add_custom()函数对顶点进行正确格式化，才能接受此操作。

source: The vertical scale(default 1).
zh_cn: 垂直缩放(默认为1)。

source: The vertical scale.
zh_cn: 纵向缩放。

source: The vertical scaling factor (use -1 to reset to default).
zh_cn: 垂直缩放系数(使用-1重置为默认值)。

source: The vertical scaling of the base particle.
zh_cn: 基本粒子的垂直缩放。

source: The vertical scaling of the image, as a multiplier: 1 = normal scaling, 0.5 is half etc...
zh_cn: 图像的垂直缩放，作为乘数: 1 = 正常缩放，0.5是一半，以此类推...

source: The vertical scaling of the sprite as a multiplier: 1 = normal scaling, 0.5 is half etc...
zh_cn: 精灵的垂直缩放乘数：1 = 正常缩放，0.5 是一半 等等......

source: The vertical scaling of the sprite, as a multiplier: 1 = normal scaling, 0.5 is half etc...
zh_cn: 精灵的垂直缩放，作为一个乘数:1 =正常缩放，0.5是一半等等……

source: The vertical scaling of the sprite.
zh_cn: 精灵的垂直缩放。

source: The vertical scaling of the surface.
zh_cn: 表面的垂直缩放。

source: The vertical scaling the part should be drawn with.
zh_cn: 绘制部分时应采用的纵向缩放。

source: The vertical scaling to draw the surface with.
zh_cn: 绘制表面时使用的垂直缩放。

source: The vertical snapping (the size in pixels between 'cells').
zh_cn: 垂直对齐("单元格"之间的像素大小)。

source: The vertical snapping to check.
zh_cn: 垂直捕捉检查。

source: The vertical speed (in pixels per game frame) to set
zh_cn: 要设置的垂直速度(像素每游戏帧)

source: The vertical tiling toggle, which can be true or false
zh_cn: 垂直平铺切换，可为真或假

source: The view port is the area on the screen where the view is drawn, and you can have up to 8 active at any one time (the array is values from 0 to 7 inclusive to give 8 ports).
zh_cn: 视图端口是屏幕上绘制视图的区域，任何时候都可以有最多8个活动端口(该数组的值从0到7，包括0和7，共8个端口)。

source: The view port to target (0 - 7)
zh_cn: 目标的视口(0 - 7)

source: The view will now not be drawn to the screen, meaning that you will need to either:
zh_cn: 视图现在不会被绘制到屏幕上，这意味着您需要:

source: The visibility of the view port (true is visible, false is invisible)
zh_cn: 视口的可见性(true可见，false不可见)

source: The visibility toggle, which can be true or false
zh_cn: 可见切换，可为 true 或 false

source: The volume is a linear value from 0 to 1.
zh_cn: 音量是从0到1的线性值。

source: The w component of the transform vector
zh_cn: 变换向量的w分量

source: The weak reference to the struct you want to check.
zh_cn: 对要检查的结构的弱引用。

source: The web address of the server that you wish to get file from
zh_cn: 您希望从中获取文件的服务器的web地址

source: The web address of the server that you wish to get information from
zh_cn: 您希望从中获取信息的服务器的web地址

source: The weld joint is designed to attach two fixtures together in a strong, yet flexible bond.
zh_cn: 焊接接头旨在将两个固定装置牢固而灵活地连接在一起。

source: The weld joint will permit flexing between the two joined fixtures but without the stretching associated with, for example, a distance joint, and will always try to "spring" back to the reference angle when put under any stress or load.
zh_cn: 焊接接头将允许两个连接的夹具之间的弯曲，但没有与例如，一个距离接头相关的拉伸，并将总是试图"弹簧"回到参考角度，当受到任何应力或负载。

source: The width (in pixels) of each individual cell of the mp_grid
zh_cn: mp_grid中每个单元格的宽度(以像素为单位)

source: The width (in pixels) of the view port
zh_cn: 视口的宽度(以像素为单位)

source: The width and height arguments are in pixels and define the width and height of the part of the surface to use.
zh_cn: 宽度和高度参数以像素为单位，定义要使用的表面部分的宽度和高度。

source: The width at which to draw the surface.
zh_cn: 绘制表面的宽度。

source: The width in pixels of the line.
zh_cn: 线条的宽度，以像素为单位。

source: The width of the GUI
zh_cn: GUI的宽度

source: The width of the area in the source surface to copy from.
zh_cn: 源表面中要复制的区域的宽度。

source: The width of the area of the screen to capture
zh_cn: 要捕获的屏幕区域的宽度

source: The width of the area the stretched sprite will occupy.
zh_cn: 被拉伸的精灵将占据的区域的宽度。

source: The width of the area the view captures.
zh_cn: 视图捕获的区域的宽度。

source: The width of the area to be copied (from the x position).
zh_cn: 要复制的区域的宽度(从x位置开始)。

source: The width of the area to draw.
zh_cn: 要绘制区域的宽度。

source: The width of the arrow head is calculated automatically in proportion to the length.
zh_cn: 箭头的宽度是根据长度的比例自动计算出来的。

source: The width of the camera view in pixels
zh_cn: 相机视图的宽度，以像素为单位

source: The width of the gif to create
zh_cn: 要创建的gif的宽度

source: The width of the grid to be created.
zh_cn: 要创建的网格的宽度。

source: The width of the line in pixels.
zh_cn: 线条的宽度，以像素为单位。

source: The width of the new surface.
zh_cn: 新表面的宽度。

source: The width of the part to be draw, from left.
zh_cn: 要绘制的部分的宽度，从左部算起。

source: The width of the part to save.
zh_cn: 要保存的部分的宽度。

source: The width of the projection at the near Z position.
zh_cn: 投影在Z位置附近的宽度。

source: The width of the projection.
zh_cn: 投影的宽度。

source: The width of the region to activate.
zh_cn: 要激活的区域的宽度。

source: The width of the region to deactivate.
zh_cn: 要停用的区域的宽度。

source: The width of the surface to be created.
zh_cn: 要创建的表面的宽度。

source: The width of the view port (or combined view ports if more than one are active) define the width of the game window or background canvas at the start of the game, so changing this value after the game has started will have no visible effect on the game window size unless called along with the function window_set_size().
zh_cn: 视口(或组合视口，如果不止一个处于活动状态)的宽度定义了游戏开始时游戏窗口或背景画布的宽度，因此在游戏开始后更改该值不会对游戏窗口大小产生明显影响，除非与函数window_set_size()一起调用。

source: The width of the virtual key
zh_cn: 虚拟键的宽度

source: The width tile map (in cells)
zh_cn: tile map宽度(以单元格为单位)

source: The width value (in "cells")
zh_cn: 宽度值(单位为"格")

source: The x and y coordinates indicate the position of the top-left corner of the grid, hcells and vcells indicate the number of horizontal and vertical cells to be created within the grid, and cell width and cell height indicate the size of the cells in pixels.
zh_cn: x和y坐标表示网格左上角的位置，hcells和vcells表示要在网格中创建的水平和垂直单元的数量，单元宽度和单元高度表示单元的大小(以像素为单位)。

source: The x and y coordinates that you then input in the function should be relative to the (0,0) position of the surface (the top left corner) and not the game window (nor the view if you have one active).
zh_cn: 然后在函数中输入的x和y坐标应该相对于表面(左上角)的(0，0)位置，而不是游戏窗口(如果你有一个活动的视图也不是)。

source: The x and y position of the particle.
zh_cn: 粒子的x和y位置。

source: The x component of direction to move in.
zh_cn: 移动方向的x分量。

source: The x component of direction to move to attempt to avoid obstacles.
zh_cn: 移动方向的x分量，以尝试避开障碍物。

source: The x component of the axis vector
zh_cn: 轴向量的x分量

source: The x component of the gravity vector
zh_cn: 重力矢量的x分量

source: The x component of the light vector
zh_cn: 灯光向量的x分量

source: The x component of the surface normal.
zh_cn: 表面法线的x分量。

source: The x component of the transform vector
zh_cn: 变换向量的x分量

source: The x component of the translation vector.
zh_cn: 平移向量的x分量。

source: The x component of the wheel axis vector
zh_cn: 轮轴向量的x分量

source: The x coordinate (left side) of the virtual key on the screen
zh_cn: 屏幕上虚拟键的x坐标(左侧)

source: The x coordinate (relative to the path) of the new point.
zh_cn: 新点的 x 坐标(相对于路径)。

source: The x coordinate for the joint, within the game world
zh_cn: 游戏世界中关节的x坐标

source: The x coordinate in the display.
zh_cn: 显示器中的x坐标。

source: The x coordinate in the room where the force will be applied
zh_cn: 将施加力的房间中的x坐标

source: The x coordinate in the room where the impulse will be applied
zh_cn: 将应用脉冲的房间中的x坐标

source: The x coordinate in the window.
zh_cn: 窗口中的x坐标。

source: The x coordinate of the "up" vector.
zh_cn: "上"向量的x坐标。

source: The x coordinate of the bottom right corner of the rectangle.
zh_cn: 矩形右下角的x坐标。

source: The x coordinate of the bottom right corner of the rounded rectangle (as if it were a normal rectangle).
zh_cn: 圆角矩形的右下角的x坐标(就像一个普通矩形一样)。

source: The x coordinate of the bottom side of the rectangle to check.
zh_cn: 要检查的矩形底边的x坐标。

source: The x coordinate of the center of the circle to check.
zh_cn: 要检查的圆心的x坐标。

source: The x coordinate of the center of the circle.
zh_cn: 圆心的x坐标。

source: The x coordinate of the centre of the circle
zh_cn: 圆心的x坐标

source: The x coordinate of the circle centre.
zh_cn: 圆心的x坐标。

source: The x coordinate of the drawn string.
zh_cn: 所绘制字符串的x坐标。

source: The x coordinate of the end of the line (where the arrowhead ends).
zh_cn: 直线末端的x坐标(箭头结束的地方)。

source: The x coordinate of the end of the line.
zh_cn: 线条终点的x坐标。

source: The x coordinate of the first anchor point of the joint in the room
zh_cn: 房间内关节的第一个锚点的x坐标

source: The x coordinate of the first component of the vector
zh_cn: 向量第一个分量的x坐标

source: The x coordinate of the first corner of the triangle to check.
zh_cn: 要检查的三角形第一个角的x坐标。

source: The x coordinate of the first side of the triangle to check.
zh_cn: 要检查的三角形第一条边的x坐标。

source: The x coordinate of the first vector.
zh_cn: 第一个向量的x坐标。

source: The x coordinate of the grid to check.
zh_cn: 要检查的网格的x坐标。

source: The x coordinate of the left of the button
zh_cn: 按钮左侧的x坐标

source: The x coordinate of the left of the ellipse.
zh_cn: 椭圆左侧的x坐标。

source: The x coordinate of the left of the healthbar
zh_cn: 健康栏左侧的x坐标

source: The x coordinate of the left of the highscore rectangle.
zh_cn: 高分矩形左侧的x坐标。

source: The x coordinate of the left of the rectangle.
zh_cn: 矩形左侧的x坐标。

source: The x coordinate of the left of the rectangular region to activate.
zh_cn: 要激活的矩形区域左侧的x坐标。

source: The x coordinate of the left of the rectangular region to deactivate.
zh_cn: 要停用的矩形区域左侧的x坐标。

source: The x coordinate of the left of the rounded rectangle.
zh_cn: 圆角矩形左侧的x坐标。

source: The x coordinate of the left side of the destination rectangle to check against.
zh_cn: 要检查的目标矩形左侧的x坐标。

source: The x coordinate of the left side of the ellipse to check.
zh_cn: 要检查的椭圆左侧的x坐标。

source: The x coordinate of the left side of the rectangle to check.
zh_cn: 要检查的矩形左侧的x坐标。

source: The x coordinate of the left side of the region.
zh_cn: 区域左侧的x坐标。

source: The x coordinate of the left side of the source rectangle.
zh_cn: 源矩形左侧的x坐标。

source: The x coordinate of the new point.
zh_cn: 新点的 x 坐标。

source: The x coordinate of the origin, relative to the sprite's top left corner.
zh_cn: 原点的x坐标，相对于精灵的左上角。

source: The x coordinate of the pixel to check
zh_cn: 要检查的像素的x坐标

source: The x coordinate of the point to be drawn.
zh_cn: 要画的点的x坐标。

source: The x coordinate of the point to check.
zh_cn: 要检查的点的x坐标。

source: The x coordinate of the point.
zh_cn: 点的x坐标。

source: The x coordinate of the position to look from.
zh_cn: 观察位置的x坐标。

source: The x coordinate of the position to look to.
zh_cn: 要查看的位置的x坐标。

source: The x coordinate of the right of the button
zh_cn: 按钮右侧的x坐标

source: The x coordinate of the right of the ellipse.
zh_cn: 椭圆右侧的x坐标。

source: The x coordinate of the right of the healthbar
zh_cn: 健康栏右侧的x坐标

source: The x coordinate of the right of the highscore rectangle.
zh_cn: 高分矩形右侧的x坐标。

source: The x coordinate of the right of the rectangle.
zh_cn: 矩形右侧的x坐标。

source: The x coordinate of the right of the rounded rectangle.
zh_cn: 圆角矩形右侧的x坐标。

source: The x coordinate of the right side of the destination rectangle to check against.
zh_cn: 要检查的目标矩形右侧的x坐标。

source: The x coordinate of the right side of the ellipse to check.
zh_cn: 要检查的椭圆右侧的x坐标。

source: The x coordinate of the right side of the rectangle to check.
zh_cn: 要检查的矩形右侧的x坐标。

source: The x coordinate of the right side of the source rectangle.
zh_cn: 源矩形右侧的x坐标。

source: The x coordinate of the right side.
zh_cn: 右侧的x坐标。

source: The x coordinate of the second anchor point of the joint in the room
zh_cn: 房间内关节的第二个锚点的x坐标

source: The x coordinate of the second component of the vector
zh_cn: 向量第二个分量的x坐标

source: The x coordinate of the second corner of the triangle to check.
zh_cn: 要检查的三角形第二个角的x坐标。

source: The x coordinate of the second side of the triangle to check.
zh_cn: 要检查的三角形第二条边的x坐标。

source: The x coordinate of the second vector.
zh_cn: 第二个向量的x坐标。

source: The x coordinate of the start of the line.
zh_cn: 直线起点的x坐标。

source: The x coordinate of the third corner of the triangle to check.
zh_cn: 要检查的三角形第三个角的x坐标。

source: The x coordinate of the third side of the triangle to check.
zh_cn: 要检查的三角形第三条边的x坐标。

source: The x coordinate of the top left corner of the area of the screen to capture
zh_cn: 要捕获的屏幕区域左上角的x坐标

source: The x coordinate of the top left corner of the rectangle.
zh_cn: 矩形左上角的x坐标。

source: The x coordinate of the top left corner of the rounded rectangle (as if it were a normal rectangle).
zh_cn: 圆角矩形的左上角的x坐标(就像一个普通矩形一样)。

source: The x coordinate of the triangle's first corner.
zh_cn: 三角形第一个角的x坐标。

source: The x coordinate of the triangle's second corner.
zh_cn: 三角形第二个角的x坐标。

source: The x coordinate of the triangle's third corner.
zh_cn: 三角形第三个角的x坐标。

source: The x coordinate of the vertex.
zh_cn: 顶点的x坐标。

source: The x coordinate of where the path is drawn
zh_cn: 路径绘制位置的x坐标

source: The x coordinate of where to change colliding instances.
zh_cn: 要更改碰撞实例的位置的x坐标。

source: The x coordinate of where to create the particles.
zh_cn: 创建粒子的位置的x坐标。

source: The x coordinate of where to destroy colliding instances.
zh_cn: 销毁碰撞实例的x坐标。

source: The x coordinate of where to draw the sprite.
zh_cn: 绘制精灵的x坐标。

source: The x coordinate of where to draw the surface.
zh_cn: 绘制表面位置的x坐标。

source: The x coordinate of where to position the window.
zh_cn: 窗口位置的x坐标。

source: The x coordinate relative to the origin where the force will be applied
zh_cn: 相对于将施加力的原点的x坐标

source: The x coordinate relative to the origin where the impulse will be applied
zh_cn: 相对于将应用脉冲的原点的x坐标

source: The x coordinate to calculate.
zh_cn: 要计算的x坐标。

source: The x coordinate where the first part of joint is anchored, within the game world
zh_cn: 在游戏世界中，关节的第一部分被锚定的x坐标

source: The x coordinate where the joint is anchored, within the game world
zh_cn: 在游戏世界中，关节锚定的x坐标

source: The x coordinate where the second part of the joint is anchored, within the game world
zh_cn: 在游戏世界中，关节的第二部分被锚定的x坐标

source: The x coordinate within the texture.
zh_cn: 纹理中的x坐标。

source: The x look vector (default 0).
zh_cn: x 轴的观察向量(默认为0)。

source: The x offset position for drawing.
zh_cn: 用于绘图的x偏移位置。

source: The x origin for the image being used.
zh_cn: 正在使用的图像的x原点。

source: The x position (in the room)
zh_cn: x 轴的位置(在房间内)

source: The x position (within the room) of the left side of the area the camera view captures.
zh_cn: 相机视图捕捉的区域左侧的x位置(在房间内)。

source: The x position for the sprite
zh_cn: 精灵的x位置

source: The x position for the tile map
zh_cn: tile map的x位置

source: The x position for the view port in the room
zh_cn: 房间中视窗的x位置

source: The x position in the room for the point.
zh_cn: 点在房间中的x位置。

source: The x position in the room to check
zh_cn: 要检查的房间中的x位置

source: The x position in the room to check.
zh_cn: 要检查的房间中的x位置。

source: The x position in the room to create the sequence at
zh_cn: 房间中要创建序列的x位置

source: The x position in the room to set the layer to
zh_cn: 房间中要设置图层的x位置

source: The x position in the source surface to copy from.
zh_cn: 要复制的源表面中的x位置。

source: The x position of the cell in the grid.
zh_cn: 单元格在网格中的x位置。

source: The x position of the cell to set.
zh_cn: 要设置的单元格的x位置。

source: The x position of the cell you want to find the value of.
zh_cn: 你想求值的单元格的x位置。

source: The x position of the center of the area to delete.
zh_cn: 要删除的区域中心的x位置。

source: The x position of the disk center in the grid.
zh_cn: 圆盘中心在网格中的x位置。

source: The x position of the disk on the grid.
zh_cn: 圆盘在网格上的x位置。

source: The x position of the left of the region in the grid, from 0 to (grid width - 1).
zh_cn: 网格中区域左侧的x位置，从0到(网格宽度- 1)。

source: The x position of the left of the region in the grid.
zh_cn: 网格中区域左侧的x位置。

source: The x position of the light
zh_cn: 灯光的x位置

source: The x position of the listener (default 0).
zh_cn: 的x位置(默认为0)。

source: The x position of the new instance.
zh_cn: 新实例的x位置。

source: The x position of the origin.
zh_cn: 原点的x位置。

source: The x position of the point to move towards.
zh_cn: 要移向的点的x位置。

source: The x position of the right of the region in the grid, from 0 to (grid width - 1).
zh_cn: 网格中区域右侧的x位置，从0到(网格宽度- 1)。

source: The x position of the right of the region in the grid.
zh_cn: 在网格中该区域右侧的x位置。

source: The x position of the tile map in the room
zh_cn: 房间中tile map的 x 位置

source: The x position of where to draw the surface.
zh_cn: 绘制表面的x位置。

source: The x position on the destination grid to add the source region to.
zh_cn: 要将源区域添加到的目标网格上的x位置。

source: The x position on the destination grid to copy the source region to.
zh_cn: 要将源区域复制到的目标网格上的x位置。

source: The x position on the destination grid to multiply the source region with.
zh_cn: 目标网格上的x位置，用来与源区域相乘。

source: The x position on the sprite of the top left corner of the area to draw.
zh_cn: 要绘制的区域的左上角精灵上的x位置。

source: The x position on the surface from which to get the pixel.
zh_cn: 在表面上获取像素的x位置。

source: The x position the object will be created at
zh_cn: 创建对象的 x 位置

source: The x position to check for instances far from.
zh_cn: 要检查远离的实例的x位置。

source: The x position to check for instances.
zh_cn: 要检查实例的 x 位置。

source: The x position to check from.
zh_cn: 要检查的 x 位置。

source: The x position to check.
zh_cn: 要检查的x位置。

source: The x position to copy from.
zh_cn: 要复制的x位置。

source: The x position to copy to.
zh_cn: 要复制到的x位置。

source: The x position to create the particle at.
zh_cn: 创建粒子的x位置。

source: The x position to create the particle group at.
zh_cn: 创建粒子组的x位置。

source: The x position to place the view at (in the room)
zh_cn: 放置视图的x位置(在房间中)

source: The x position to use
zh_cn: 要使用的 x 坐标

source: The x position within the room to draw at
zh_cn: 要绘制的房间内的x位置

source: The x position within the room to use for getting the cell
zh_cn: 房间内用于获取单元格的x位置

source: The x position within the window.
zh_cn: 窗口内的x位置。

source: The x position.
zh_cn: x坐标。

source: The x positioning of the effect if relevant.
zh_cn: 相关效果的x位置。

source: The x scale amount.
zh_cn: x轴缩放值。

source: The x up vector (default 0).
zh_cn: x 轴向上向量(默认值为0)。

source: The x value of an instance is the horizontal position in the current room, measured in pixels.
zh_cn: 实例的x值是当前房间中的水平位置，以像素为单位。

source: The x vector value (default 0).
zh_cn: x 向量值(默认为0)。

source: The x velocity component of the listener (default 0).
zh_cn: 侦听器的x速度分量(默认为0)。

source: The x velocity of the listener (default 0).
zh_cn: 侦听器的x速率(默认为0)。

source: The xscale value (default is 1)
zh_cn: x 轴缩放值(默认值为1)

source: The xstart and ystart arguments indicate the start of the path in room coordinates, while xgoal, ygoal arguments indicate the destination.
zh_cn: xstart和ystart参数表示房间坐标中路径的起点，而xgoal、ygoal参数表示目的地。

source: The y component of direction to move in.
zh_cn: 要移入的方向的y分量。

source: The y component of direction to move to attempt to avoid obstacles.
zh_cn: 移动方向的y分量，以尝试避开障碍物。

source: The y component of the axis vector
zh_cn: 轴向量的y分量

source: The y component of the gravity vector
zh_cn: 重力向量的y分量

source: The y component of the light vector
zh_cn: 灯光向量的y分量

source: The y component of the surface normal.
zh_cn: 表面法线的y分量。

source: The y component of the transform vector
zh_cn: 变换向量的y分量

source: The y component of the translation vector.
zh_cn: 平移向量的y分量。

source: The y component of the wheel axis vector
zh_cn: 轮轴向量的y分量

source: The y coordinate (relative to the path) of the new point.
zh_cn: 新点的 y 坐标(相对于路径)。

source: The y coordinate (top side) of the virtual key on the screen
zh_cn: 屏幕上虚拟键的y坐标(上边)

source: The y coordinate for the joint, within the game world
zh_cn: 游戏世界中关节的y坐标

source: The y coordinate in the display.
zh_cn: 显示器中的y坐标。

source: The y coordinate in the room where the force will be applied
zh_cn: 将应用力的房间中的y坐标

source: The y coordinate in the room where the impulse will be applied
zh_cn: 将应用脉冲的房间中的y坐标

source: The y coordinate in the window.
zh_cn: 窗口中的y坐标。

source: The y coordinate of the "up" vector.
zh_cn: "上"向量的y坐标。

source: The y coordinate of the bottom of the button
zh_cn: 按钮底部的y坐标

source: The y coordinate of the bottom of the ellipse.
zh_cn: 椭圆底部的y坐标。
